clivan/Programaci-n-de-sistemas-embebidos/Alarma/board/pin_mux.c
    /* PORTA1 (pin 27) is configured as UART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_DEBUG_UART_RX_PORT, BOARD_INITPINS_DEBUG_UART_RX_PIN, kPORT_MuxAlt2);

    /* PORTA2 (pin 28) is configured as UART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_DEBUG_UART_TX_PORT, BOARD_INITPINS_DEBUG_UART_TX_PIN, kPORT_MuxAlt2);

    /* PORTB0 (pin 43) is configured as PTB0 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D0_PORT, BOARD_INITPINS_LCD_D0_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 44) is configured as PTB1 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D1_PORT, BOARD_INITPINS_LCD_D1_PIN, kPORT_MuxAsGpio);

    /* PORTB10 (pin 49) is configured as PTB10 */
    PORT_SetPinMux(BOARD_INITPINS_Columna_3_PORT, BOARD_INITPINS_Columna_3_PIN, kPORT_MuxAsGpio);

    /* PORTB11 (pin 50) is configured as PTB11 */
    PORT_SetPinMux(BOARD_INITPINS_Columna_4_PORT, BOARD_INITPINS_Columna_4_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 45) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D2_PORT, BOARD_INITPINS_LCD_D2_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 46) is configured as PTB3 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D3_PORT, BOARD_INITPINS_LCD_D3_PIN, kPORT_MuxAsGpio);

    /* PORTB8 (pin 47) is configured as PTB8 */
    PORT_SetPinMux(BOARD_INITPINS_Columna_1_PORT, BOARD_INITPINS_Columna_1_PIN, kPORT_MuxAsGpio);

    /* PORTB9 (pin 48) is configured as PTB9 */
    PORT_SetPinMux(BOARD_INITPINS_Columna_2_PORT, BOARD_INITPINS_Columna_2_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 55) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_Red_PORT, BOARD_INITPINS_Red_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin 56) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_RS_PORT, BOARD_INITPINS_LCD_RS_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t Sense_3 = {/* Internal pull-up resistor is enabled */
                                       kPORT_PullUp,
                                       /* Slow slew rate is configured */
                                       kPORT_SlowSlewRate,
                                       /* Passive filter is disabled */
                                       kPORT_PassiveFilterDisable,
                                       /* Low drive strength is configured */
                                       kPORT_LowDriveStrength,
                                       /* Pin is configured as PTC10 */
                                       kPORT_MuxAsGpio};
    /* PORTC10 (pin 67) is configured as PTC10 */
    PORT_SetPinConfig(BOARD_INITPINS_Sense_3_PORT, BOARD_INITPINS_Sense_3_PIN, &Sense_3);

    const port_pin_config_t Sense_4 = {/* Internal pull-up resistor is enabled */
                                       kPORT_PullUp,
                                       /* Slow slew rate is configured */
                                       kPORT_SlowSlewRate,
                                       /* Passive filter is disabled */
                                       kPORT_PassiveFilterDisable,
                                       /* Low drive strength is configured */
                                       kPORT_LowDriveStrength,
                                       /* Pin is configured as PTC11 */
                                       kPORT_MuxAsGpio};
    /* PORTC11 (pin 68) is configured as PTC11 */
    PORT_SetPinConfig(BOARD_INITPINS_Sense_4_PORT, BOARD_INITPINS_Sense_4_PIN, &Sense_4);

    /* PORTC2 (pin 57) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_RW_PORT, BOARD_INITPINS_LCD_RW_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 58) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_Green_PORT, BOARD_INITPINS_Green_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 61) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_Yellow_PORT, BOARD_INITPINS_Yellow_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t Sense_1 = {/* Internal pull-up resistor is enabled */
                                       kPORT_PullUp,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Passive filter is disabled */
                                       kPORT_PassiveFilterDisable,
                                       /* Low drive strength is configured */
                                       kPORT_LowDriveStrength,
                                       /* Pin is configured as PTC5 */
                                       kPORT_MuxAsGpio};
    /* PORTC5 (pin 62) is configured as PTC5 */
    PORT_SetPinConfig(BOARD_INITPINS_Sense_1_PORT, BOARD_INITPINS_Sense_1_PIN, &Sense_1);

    const port_pin_config_t Sense_2 = {/* Internal pull-up resistor is enabled */
                                       kPORT_PullUp,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Passive filter is disabled */
                                       kPORT_PassiveFilterDisable,
                                       /* Low drive strength is configured */
                                       kPORT_LowDriveStrength,
                                       /* Pin is configured as PTC6 */
                                       kPORT_MuxAsGpio};
    /* PORTC6 (pin 63) is configured as PTC6 */
    PORT_SetPinConfig(BOARD_INITPINS_Sense_2_PORT, BOARD_INITPINS_Sense_2_PIN, &Sense_2);

    /* PORTC7 (pin 64) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITPINS_Buzzer_PORT, BOARD_INITPINS_Buzzer_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t Renglon_4 = {/* Internal pull-up resistor is enabled */
                                         kPORT_PullUp,
                                         /* Slow slew rate is configured */
                                         kPORT_SlowSlewRate,
                                         /* Passive filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Pin is configured as PTE2 */
                                         kPORT_MuxAsGpio};
    /* PORTE2 (pin 3) is configured as PTE2 */
    PORT_SetPinConfig(BOARD_INITPINS_Renglon_4_PORT, BOARD_INITPINS_Renglon_4_PIN, &Renglon_4);

    /* PORTE20 (pin 13) is configured as PTE20 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D4_PORT, BOARD_INITPINS_LCD_D4_PIN, kPORT_MuxAsGpio);

