clivan/Programaci-n-de-sistemas-embebidos/Alarma/board/pin_mux.c
    /* PORTE21 (pin 14) is configured as PTE21 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D5_PORT, BOARD_INITPINS_LCD_D5_PIN, kPORT_MuxAsGpio);

    /* PORTE22 (pin 15) is configured as PTE22 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D6_PORT, BOARD_INITPINS_LCD_D6_PIN, kPORT_MuxAsGpio);

    /* PORTE23 (pin 16) is configured as PTE23 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D7_PORT, BOARD_INITPINS_LCD_D7_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t Renglon_3 = {/* Internal pull-up resistor is enabled */
                                         kPORT_PullUp,
                                         /* Slow slew rate is configured */
                                         kPORT_SlowSlewRate,
                                         /* Passive filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Pin is configured as PTE3 */
                                         kPORT_MuxAsGpio};
    /* PORTE3 (pin 4) is configured as PTE3 */
    PORT_SetPinConfig(BOARD_INITPINS_Renglon_3_PORT, BOARD_INITPINS_Renglon_3_PIN, &Renglon_3);

    /* PORTE30 (pin 22) is configured as PTE30 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_E_PORT, BOARD_INITPINS_LCD_E_PIN, kPORT_MuxAsGpio);

    const port_pin_config_t Renglon_2 = {/* Internal pull-up resistor is enabled */
                                         kPORT_PullUp,
                                         /* Slow slew rate is configured */
                                         kPORT_SlowSlewRate,
                                         /* Passive filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Pin is configured as PTE4 */
                                         kPORT_MuxAsGpio};
    /* PORTE4 (pin 5) is configured as PTE4 */
    PORT_SetPinConfig(BOARD_INITPINS_Renglon_2_PORT, BOARD_INITPINS_Renglon_2_PIN, &Renglon_2);

    const port_pin_config_t Renglon_1 = {/* Internal pull-up resistor is enabled */
                                         kPORT_PullUp,
                                         /* Slow slew rate is configured */
                                         kPORT_SlowSlewRate,
                                         /* Passive filter is disabled */
                                         kPORT_PassiveFilterDisable,
                                         /* Low drive strength is configured */
                                         kPORT_LowDriveStrength,
                                         /* Pin is configured as PTE5 */
                                         kPORT_MuxAsGpio};
    /* PORTE5 (pin 6) is configured as PTE5 */
    PORT_SetPinConfig(BOARD_INITPINS_Renglon_1_PORT, BOARD_INITPINS_Renglon_1_PIN, &Renglon_1);

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART0TXSRC_MASK | SIM_SOPT5_UART0RXSRC_MASK)))

                  /* UART0 transmit data source select: UART0_TX pin. */
                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX)

                  /* UART0 receive data source select: UART0_RX pin. */
                  | SIM_SOPT5_UART0RXSRC(SOPT5_UART0RXSRC_UART_RX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
